Revit 2027 API
BuiltInFailures.SketchFailures.SculptingLoopsOnBothSidesOfAxis Property
 All curves must be on the same side of the axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SculptingLoopsOnBothSidesOfAxis { get; }
Public Shared ReadOnly Property SculptingLoopsOnBothSidesOfAxis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SculptingLoopsOnBothSidesOfAxis {
	FailureDefinitionId^ get ();
}
static member SculptingLoopsOnBothSidesOfAxis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace